Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: If MaxParams is 1 for Get or 2 for Set and IsVariadic is false or undefined, the property cannot accept parameters; they are instead forwarded to the __Item property of the object returned by get.
ja: MaxParamsがGetが 1、Setが 2 で、IsVariadicが false または undefined の場合、このプロパティはパラメータを受け取ることができません; これらは、代わりに get によって返されたオブジェクトの __Item プロパティに転送されます。

source: If Notepad appears within this number of seconds, its priority is set to "Low" and the script's own priority is set to "High".
ja: この秒数以内にメモ帳が表示された場合、その優先度は「低」に、スクリプト自身の優先度は「高」に設定されます。

source: If Notepad does exist, activate it, otherwise activate the calculator.
ja: メモ帳があればそれを起動し、なければ電卓を起動する。

source: If Notepad does exist, close it, otherwise close the calculator.
ja: メモ帳があればそれを閉じ、なければ電卓を閉じる。

source: If Notepad does exist, force it to close, otherwise force the calculator to close.
ja: メモ帳が起動しているときはそれを強制的に閉じ、そうでない場合は電卓を強制的に閉じます。

source: If Notepad does exist, retrieve and report its position.
ja: メモ帳が存在する場合は、その位置を検索して報告します。

source: If Notepad does exist, retrieve and report the position of its client area.
ja: メモ帳が存在するときは、そのクライアント領域の位置を取得して報告します。

source: If Notepad is not running:
ja: メモ帳が起動していない場合：

source: If Notepad++ is installed, this has the effect of adding it to the "open with" menu for .ahk files.
ja: Notepad++がインストールされている場合、.ahkファイルの「open with」メニューに追加される効果もあります。

source: If OwnProps returned the method itself when a getter is defined by a base object, this would be inconsistent with normal evaluation of the property.
ja: ゲッターがベースオブジェクトによって定義されている場合に、OwnPropsがメソッド自体を返すと、プロパティの通常の評価と矛盾することになります。

source: If OwnProps returned the method itself when no getter is defined, defining a getter would then prevent the method from being returned.
ja: OwnPropsはゲッターが定義されていない場合、メソッドそのものを返すので、ゲッターを定義するとメソッドが返されなくなります。

source: If PCRE finds a way to improve performance, that discovery is stored alongside the pattern in the cache for use by subsequent executions of the same pattern (subsequent uses of that pattern should also specify the S option because finding a match in the cache requires that the option letters exactly match, including their order).
ja: PCRE がパフォーマンスを向上させる方法を発見した場合、その発見はキャッシュにパターンと一緒に保存され、同じパターンの後続の実行で使用できるようになる（キャッシュでマッチを見つけるには、オプションの文字が順番も含めて正確にマッチする必要があるため、そのパターンの後続の使用でも S オプションを指定する必要がある）。

source: If Persistent is not used, the default setting is 0 (false).
ja: Persistent関数が使われないときは、初期値は0 (false)です。

source: If R is omitted, files and folders in subfolders are not included.
ja: Rが省略された場合、サブフォルダー内のファイルやフォルダーは含まれません。

source: If R is omitted, keys and values within subkeys of KeyName are not included.
ja: R が省略された場合、KeyNameのサブキー内のキーと値は含まれません。

source: If SendLevel is used during script startup, it also affects keyboard and mouse remapping.
ja: スクリプト起動時にSendLevelを使用した場合、キーボードとマウスのリマッピングにも影響します。

source: If SendMode is used during script startup, it also affects keyboard and mouse remapping.
ja: スクリプト起動時にSendModeを使用した場合、キーボードとマウスのリマッピングにも影響します。

source: If SetControlDelay is not used, the default delay is 20.
ja: SetControlDelay関数を使用しないときは、デフォルトの遅延は20ミリセカンドとなります。

source: If SetDefaultMouseSpeed is not used, the default mouse speed is 2.
ja: SetDefaultMouseSpeed関数が使われていないときは、マウスポインターの速度の初期値は2です。

source: If SetKeyDelay is never used by a script, the default Delay for the tradional SendEvent mode is 10.
ja: SetKeyDelayがスクリプトで使用されない場合、従来のSendEventモードのデフォルトDelayは10です。

source: If SetKeyDelay is not used, the default delay is 10 for the traditional SendEvent mode and -1 for SendPlay mode.
ja: SetKeyDelay関数を使用しないときは、遅延の初期値はは、従来のSendEventモードでは 10、SendPlayモードでは-1です。

source: If SetMouseDelay is not used, the default delay is 10 for the traditional SendEvent mode and -1 for SendPlay mode.
ja: SetMouseDelay関数を使用しないときは、遅延の初期値はは、従来のSendEventモードでは 10、SendPlayモードでは-1です。

source: If SetRegView is not used, the default setting is Default.
ja: SetRegView関数が使われないときは、初期値はDefaultです。

source: If SetStoreCapsLockMode is not used, the default setting is 1 (true).
ja: SetStoreCapsLockMode関数が使われていないときは、初期値は1 (true)です。

source: If SetTimer is used on an existing timer, the timer is reset (unless Priority is specified and Period is omitted); in other words, the entirety of its period must elapse before its function will be called again.
ja: SetTimerを既存のタイマーに使用した場合、タイマーはリセットされる（Priorityが指定され、Periodが省略された場合を除く）、言い換えれば、その関数が再び呼び出される前にその期間の全体が経過する必要がある。

source: If SetTitleMatchMode is not used, the default match mode is 2 and the default speed is fast.
ja: SetTitleMatchModeを使用しない場合、デフォルトのマッチ・モードは2で、デフォルトのスピードは速い。

source: If SetWinDelay is not used, the default delay is 100.
ja: SetWinDelayを使用しない場合、デフォルトの遅延は100である。

source: If UAC is disabled, *RunAs will launch the process without elevating it.
ja: UACが無効の場合、*RunAsは昇格させずにプロセスを起動します。

source: If WS_CLIPSIBLINGS is not specified and child windows overlap, it is possible, when drawing within the client area of a child window, to draw within the client area of a neighboring child window.
ja: WS_CLIPSIBLINGSが指定されず、子ウィンドウが重なっている場合、子ウィンドウのクライアント領域内に描画すると、隣接する子ウィンドウのクライアント領域内に描画される可能性がある。

source: If WinWait is still waiting, it will appear at the very bottom of the list of lines, followed by the number of seconds since it began waiting.
ja: WinWaitがまだ待機している場合は、行のリストの一番下に表示され、その後に待機を始めてからの秒数が表示されます。

source: If WinWait times out, an error message is shown, otherwise Notepad is minimized.
ja: WinWait関数がタイムアウトしたときはエラーメッセージが表示され、そうでないときはメモ帳が最小化されます。

source: If WinWait times out, its result is 0.
ja: WinWaitがタイムアウトした場合、その結果は0となる。

source: If __Call is present, there is no way to detect which methods it may support.
ja: もし__Callが存在する場合、どのメソッドをサポートしているかを検出する方法はありません。

source: If __Enum is not present, the object is assumed to be an enumerator.
ja: __Enumが存在しない場合、オブジェクトは列挙者であるとみなされます。

source: If a hotkey is pressed or a custom menu item is selected while the current thread is uninterruptible, that event will be buffered.
ja: 現在のスレッドが中断されていない間にホットキーが押されたり、カスタムメニュー項目が選択されたりすると、そのイベントはバッファリングされる。

source: If a variable or parameter is said to be "empty" or "blank", that usually means an empty string (a string of zero length).
ja: 変数や パラメータが「空」または「ブランク」と言われる場合、それは通常、空文字列（長さがゼロの文字列）を意味します。

source: If a window group is used, the current title match mode applies to each individual rule in the group.
ja: ウィンドウ・グループを使用する場合、現在のタイトル・マッチ・モードは、グループ内の個々のルールに適用される。

source: If a label is specified, it must point directly at a loop statement.
ja: ラベルを指定する場合は、ループステートメントを直接指定する必要があります。

source: If a hotkey, hotstring or InputHook requires the hook, it will stop working until the hook is reinstalled.
ja: ホットキー、ホットストリング、InputHookがフックを必要とする場合、フックが再インストールされるまで動作が停止します。

source: If a MatchList item caused the Input to terminate, the Match property can be consulted to determine exactly which match (this is more useful when the * option is present).
ja: MatchListの項目が原因でInputが終了した場合、Matchプロパティを参照することで、正確にどのようなマッチがあったかを判断することができます（これは、* optionがある場合に便利です）。

source: If a character does not correspond to a virtual key on the current keyboard layout, it cannot be "pressed" or "released".
ja: 文字が現在のキーボードレイアウト上の仮想キーに対応していない場合、「押す」「離す」ことができません。

source: If a class overrides a property, it can use super.Property to access the property defined by its base class.
ja: クラスがプロパティをオーバーライドする場合は super.Propertyを使用して、ベース・クラスで定義されたプロパティにアクセスできます。

source: If a control type does not support this option, an error is thrown.
ja: 制御型がこのオプションをサポートしていない場合、エラーが発生します。

source: If a control type had no single "value", GuiControlGet defaulted to returning the result of GetWindowText (which isn't always visible text).
ja: コントロールタイプに単一の「値」がない場合、GuiControlGetはGetWindowTextの結果を返すのがデフォルトでした（これは必ずしも可視テキストではありません）。

source: If a debugger is not active, this will have no effect.
ja: デバッガがアクティブでない場合は、何の効果もありません。

source: If a decimal point is present in the returned value, that part is ignored (i.e. 0.8 is the same as 0).
ja: 返される値に小数点がある場合、その部分は無視されます（つまり0.8は0と同じ）。

source: If a drive is locked by a script and that script exits, the drive will stay locked until another script or program unlocks it, or the system is restarted.
ja: スクリプトによってドライブがロックされ、そのスクリプトが終了すると、他のスクリプトやプログラムによってロックが解除されるか、システムが再起動されるまで、そのドライブはロックされたままになります。

source: If a file exists at %A_WinDir%\ShellNew\Template.ahk, it is shown as "Legacy" and can be overridden by a user-defined template of that name.
ja: ファイルが%A_WinDir%\ShellNew\Template.ahkに存在する場合、それは「Legacy」として表示され、その名前のユーザー定義テンプレートで上書きすることができる。

source: If a file is created, a byte order mark (BOM) is written only if "UTF-8" or "UTF-16" has been specified within Options.
ja: ファイルを作成する場合、オプションで「UTF-8」または「UTF-16」を指定した場合のみ、BOM（Byte Order Mark）が書き込まれます。

source: If a file is launched without a verb, the default verb (usually "open") for that particular file type will be used.
ja: 動詞を指定せずにファイルを起動した場合、そのファイルタイプのデフォルトの動詞（通常は「open」）が使用されます。

source: If a file is playing and the current script plays a second file, the first file will be stopped so that the second one can play.
ja: あるファイルが再生中で、現在のスクリプトが2つ目のファイルを再生する場合、2つ目のファイルが再生できるように、1つ目のファイルは停止される。

source: If a file with this name already exists at this location, it will be overwritten.
ja: この名前のファイルがこの場所にすでに存在する場合、上書きされます。

source: If a full path is not specified, this function uses the search sequence specified by the system LoadLibrary function.
ja: フルパスが指定されない場合は、システムのLoadLibrary関数で指定された検索順序を使用します。

source: If a function does not accept any parameters, leave the parentheses empty; for example:
ja: 関数がパラメータを受け付けない場合は、括弧の中を空にしてください（例）。

source: If a function does not accept any parameters, leave the parentheses empty; for example: GetCurrentTimestamp().
ja: 関数がパラメータを受け付けない場合は、括弧の中を空にしてください（例：GetCurrentTimestamp()）。

source: If a function is declared assume-global, any local or static variables created outside that function are not directly accessible to the function itself or any of its nested functions.
ja: 関数がassume-globalと宣言された場合、その関数の外で作られたローカル変数や静的変数は、関数自身やそのネストした関数から直接アクセスできません。

source: If a function needs to access or create a large number of global variables, it can be defined to assume that all its variables are global (except its parameters) by making its first line the word "global".
ja: ある関数が多数のグローバル変数にアクセスしたり作成したりする必要がある場合、その関数の最初の行を "global"とすることで、（パラメータを除く）すべての変数がグローバルであると仮定するよう定義することができます。

source: If a function writes a new address to a Str*, AStr* or WStr* parameter, DllCall now assigns the new string to the corresponding variable if one was supplied, instead of merely updating the length of the original string (which probably hasn't changed).
ja: 関数がStr*、AStr*、またはWStr*パラメータに新しいアドレスを書き込む場合、DllCallは、元の文字列の長さ（おそらく変更されていない）を単に更新するのではなく、対応する変数が提供されている場合は新しい文字列を代入するようになりました。

source: If a game has a cheat prevention system and your hotkeys, hotstrings and Send functions do not work, you are out of luck.
ja: ゲームにチート防止システムがあり、ホットキー、ホットストリング、送信機能が動作しない場合は、運が悪かったと言えます。

source: If a given hotkey has multiple #HotIf variants, the timeout might be applied to each variant independently, making it more likely that the system timeout will be exceeded.
ja: あるホットキーに複数の#HotIfのバリエーションがある場合、タイムアウトはそれぞれのバリエーションに独立して適用され、システムのタイムアウトを超過する可能性が高くなります。

source: If a hotkey has been disabled via the Hotkey function, it will be listed as OFF or PART ("PART" means that only some of the hotkey's variants are disabled).
ja: ホットキー機能によってホットキーが無効化されている場合、OFFまたはPARTとして表示されます（「PART」は、ホットキーの一部のバリエーションのみが無効化されることを意味します）。

source: If a hotkey like #z:: produces an error like "Invalid Hotkey", your system's keyboard layout/language might not have the specified character ("Z" in this case).
ja: #z::のようなホットキーで「Invalid Hotkey」のようなエラーが発生する場合、システムのキーボードレイアウト/言語に指定された文字（この場合は「Z」）がない可能性があります。

source: If a hotkey name is specified, the original function of that hotkey is used; and unlike before, this works with #HotIf (formerly #If).
ja: ホットキー名が指定されている場合は、そのホットキーの本来の機能が使用されます。また、以前とは異なり、#HotIf（旧#If）とも連動します。

source: If a key name used in EndKeys corresponds to a VK which is shared between two physical keys (such as NumpadUp and Up), the Input command handles the primary key by VK and the secondary key by SC, whereas InputHook handles both by SC.
ja: EndKeysで使用されるキー名が、2つの物理キー（NumpadUpと Upなど）で共有されるVKに対応する場合、Inputコマンドは主キーをVKで、副キーをSCで処理するが、InputHookは両方をSCで処理します。

source: If a large variable was sorted and later its contents are no longer needed, you can free its memory by making it blank, e.g. MyVar := "".
ja: 大きな変数がソートされ、後でその内容が不要になった場合、例えばMyVar := ""のように空白にすることでメモリを解放することができます。

source: If a loop variable is a ByRef parameter, the target variable is unaffected by the loop.
ja: ループ変数がByRef パラメータである場合、対象変数はループの影響を受けません。

source: If a match is found, an object containing information about the match is stored in OutputVar.
ja: 一致した場合、一致した情報を含むオブジェクトがOutputVarに格納される。

source: If a match is still not found and the library's name contains an underscore (e.g. MyPrefix_MyFunc), the program searches again with just the prefix (e.g. MyPrefix.ahk).
ja: それでも一致するものが見つからず、ライブラリ名にアンダースコア（例：MyPrefix_MyFunc）が含まれている場合、プログラムは接頭辞（例：MyPrefix.ahk）だけで再度検索を行います。

source: If a matching process is not found or cannot be manipulated, zero is returned.
ja: 一致するプロセスが見つからなかったり、操作できなかったりした場合は、0を返します。

source: If a matching window comes into existence, the function will not wait for Timeout to expire.
ja: マッチするウィンドウが存在するときは、タイムアウトになるまで待ちません。

source: If a matching window is active, that window will be closed in preference to any other matching window.
ja: 一致するウィンドウがアクティブな場合、そのウィンドウは他の一致するウィンドウよりも優先して閉じられます。

source: If a memory address is passed, Bytes must also be specified.
ja: メモリアドレスを渡す場合は、Byteも指定する必要がある。

source: If a menu ever becomes completely empty -- such as by using MyMenu.Delete() -- it cannot be shown.
ja: MyMenu.Delete()などでメニューが完全に空になった場合は、表示することができません。

source: If a menu item's callback is already running and the user selects the same menu item again, a new thread will be created to run that same callback, interrupting the previous thread.
ja: メニュー項目のコールバックがすでに実行されている状態で、ユーザーが同じメニューを再度選択した場合、その同じコールバックを実行するために新しいスレッドが作成され、前のスレッドを中断させます。

source: If a message arrives while its function is still running due to a previous arrival of the same message, by default the function will not be called again; instead, the message will be treated as unmonitored.
ja: 以前に同じメッセージが到着したために、その関数がまだ実行されている間にメッセージが到着した場合、デフォルトでは、その関数は再び呼び出されず、代わりに、メッセージは監視されていないものとして扱われます。

source: If a meta-function is defined, it must perform whatever default action is required.
ja: メタファンクションが定義されているときは、そのメタファンクションは必要なデフォルトアクションを全て実行しなければなりません。

source: If a modifier hotkey such as ~*RWin:: called Send or GetKeyState too soon, the OS could report that RWin isn't down, so the hook's modifier state would be "corrected" and hotkeys would wrongly fire or fail to fire.
ja: もし~*RWin::のようなモディファイアホットキーがSendやGetKeyStateを呼び出すのが早すぎると、OSはRWinがダウンしていないと報告する可能性があり、フックのモディファイアの状態が「修正」され、ホットキーが誤って発火したり、発火しなかったりします。

source: If a monitor function uses Return without any parameters, or it specifies a blank value such as "" (or it never uses Return at all), the incoming message goes on to be processed normally when the function finishes.
ja: モニター関数がパラメータなしでReturnを使用するか、""などの空白の値を指定する（または Return を全く使用しない）場合、受信したメッセージは関数が終了したときに通常通り処理されます。

source: If a monitored message arrives and is not buffered, its function is called immediately even if the thread is uninterruptible when the message is received.
ja: 監視対象メッセージが到着し、バッファリングされていない場合、メッセージ受信時にスレッドが中断不可能であったとしても、その関数は直ちに呼び出されます。

source: If a monitored message that is numerically greater than 0x0311 is posted while the script is uninterruptible, the message is buffered; that is, its function is not called until the script becomes interruptible.
ja: スクリプトが中断不可能な状態で0x0311より大きい数値の監視メッセージが投稿された場合、そのメッセージはバッファリングされます；つまり、スクリプトが中断可能になるまでその関数は呼ばれません。

source: If a naked letter is sent (that is, without modifiers or braces), or if Raw mode is in effect, it is sent as a character.
ja: 裸の文字が送られる場合（つまり、修飾語や中括弧がない場合）、またはRawモードが有効な場合は、文字として送信されます。

source: If a negative integer is specified for an unsigned argument, the integer wraps around into the unsigned domain.
ja: 符号なし引数に負の整数を指定した場合、整数は符号なし領域へ回り込みます。

source: If a non-default masking character is desired, include it immediately after the word Password.
ja: デフォルト以外のマスキング文字にしたいときは、Passwordの直後に含めてください。

source: If a non-zero offset is used, the behaviour is the same as in v1.
ja: オフセットが0でない場合は、v1と同じ動作となります。

source: If a number is given, it is automatically converted to a string.
ja: 数値が与えられると、自動的に文字列に変換される。

source: If a parameter contains spaces, enclose it in double quotes.
ja: パラメータにスペースが含まれる場合は、二重引用符で囲んでください。

source: If a parameter in a function-call resolves to a variable (e.g. Var or ++Var or Var*=2), other parameters to its left or right can alter that variable before it is passed to the function.
ja: 関数呼び出しのパラメータが変数に解決する場合（例：Var、++Var、Var*=2）、その左または右の他のパラメータは、関数に渡される前にその変数を変更できます。

source: If a partially hidden label in any list-view mode lacks ToolTip text, the list-view control will unfold the label.
ja: どのリストビューモードでも、部分的に隠されたラベルにToolTipテキストがない場合、リストビューコントロールはラベルを展開します。

source: If a particular key combination does not work automatically, the use of a context-sensitive hotkey may be required.
ja: 特定のキーの組み合わせが自動的に機能しない場合は、コンテキスト依存のホットキーの使用が必要になる場合があります。

source: If a particular type of window does not respond correctly to WinMaximize, try using the following instead:
ja: 特定のタイプのウィンドウがWinMaximizeに正しく反応しない場合は、代わりに以下を試してください：

source: If a particular type of window does not respond correctly to WinMinimize, try using the following instead:
ja: 特定のタイプのウィンドウがWinMinimizeに正しく反応しない場合は、代わりに以下を試してください：

source: If a particular type of window does not respond correctly to WinRestore, try using the following instead:
ja: 特定のタイプのウィンドウがWinRestoreに正しく反応しない場合は、代わりに以下を使用してみてください：

source: If a plain integer N is specified, it is assumed to be ID number of the sibling after which to insert the new item (if N is the only option present, it does not have to be enclosed in quotes).
ja: プレーンな整数Nが指定された場合、それは新しい項目を挿入する兄弟のID番号とみなされる（Nが唯一のオプションの場合、引用符で囲む必要はない）。

source: If a property defines get but not set, assigning a value throws instead of overriding the property.
ja: プロパティがgetを定義し、setを定義していない場合、値を代入すると、プロパティをオーバーライドする代わりにthrowが発生します。

source: If a property does not accept parameters, they are automatically passed to the object returned by the property (or it throws).
ja: プロパティがパラメータを受け付けない場合、パラメータは自動的にプロパティが返すオブジェクトに渡されます（または、投げられます）。

source: If a property is invoked with parameters but has none defined, parameters are automatically forwarded to the __Item property of the object returned by get.
ja: プロパティがパラメータ付きで呼び出され、何も定義されていない場合、パラメータは自動的にgetによって返されるオブジェクトの__Itemプロパティに転送される。

source: If a property without a call accessor function (a method) is called, get is invoked with no parameters and the result is then called as a method.
ja: 呼び出しアクセッサ関数（メソッド）を持たないプロパティが呼び出された場合、getはパラメータなしで呼び出され、その結果はメソッドとして呼び出される。

source: If a proxy server has been configured in Microsoft Internet Explorer's settings, it will be used.
ja: Microsoft Internet Explorerの設定でプロキシサーバーが設定されている場合は、そのサーバーを使用します。

source: If a pure number is needed, simply perform another math operation on Round's return value; for example:
ja: 純粋な数値が必要な場合は、Roundの戻り値に対して別の数学演算を行うだけです；例えば：

source: If a pure number is needed, simply perform another math operation on Round's return value; for example: Round(3.333, 1)+0.
ja: 純粋な数値が必要な場合は、Roundの戻り値に対して別の数学演算を行うだけです；例えば：Round(3.333, 1)+0。

source: If a qualified window exists, the Last Found Window will be updated to be that window.
ja: 適格なウィンドウが存在する場合、Last Found Windowは、そのウィンドウに更新される。

source: If a relative path is specified, the directive searches for the file using the same search strategy as the system's function LoadLibraryW.
ja: 相対パスが指定された場合、システムの関数LoadLibraryWと同じ検索方法でファイルを検索します。

source: If a script other than the one executing SendInput has a low-level keyboard hook installed, SendInput automatically reverts to SendEvent (or SendPlay if SendMode "InputThenPlay" is in effect).
ja: SendInputを実行しているスクリプト以外のスクリプトに低レベルのキーボードフックがインストールされている場合、SendInputは自動的にSendEvent（SendMode "InputThenPlay"が有効な場合はSendPlay）に戻されます。

source: If a script function which writes information to a file accepts a File object as a parameter, it needs not know how the file was opened.
ja: ファイルに情報を書き込むスクリプト関数が、Fileオブジェクトをパラメータとして受け取る場合、そのファイルがどのように開かれたかを知る必要はない。

source: If a script gets into a runaway loop or is otherwise difficult to stop, you can log off or shut down the computer as a last resort.
ja: スクリプトの暴走や停止が困難な場合は、最終手段としてログオフやシャットダウンすることができます。

source: If a script never uses this parameter, the delay is always -1 for SendPlay.
ja: スクリプトがこのパラメータを使用しない場合、SendPlayの遅延は常に-1です。

source: If a script never uses this parameter, the delay is always -1/-1 for SendPlay.
ja: スクリプトがこのパラメータを使用しない場合、SendPlayの遅延は常に-1/-1となります。

source: If a script's Hotkeys, Clicks, or Sends are noticeably slower than normal while the CPU is under heavy load, raising the script's process-priority may help.
ja: CPUに大きな負荷がかかっているときに、スクリプトのHotkey、Click、Sendが通常より明らかに遅くなる場合は、スクリプトのプロセス優先度を上げると改善する場合があります。

source: If a second thread is started -- such as by pressing another hotkey while the previous is still running -- the current thread will be interrupted (temporarily halted) to allow the new thread to become current.
ja: 前のスレッドがまだ実行されているときに別のホットキーを押すなどして、2番目のスレッドが開始されると、新しいスレッドが実行できるように、現在のスレッドは中断（一時的に停止）される。

source: If a subclass does not own a property by that name, Subclass.ClassVar can also be used to retrieve the value; so if the value is a reference to an object, subclasses will share that object by default.
ja: サブクラスがその名前のプロパティを所有していない場合、Subclass.ClassVarを使用して値を取得することもできます。したがって、値がオブジェクトへの参照である場合、サブクラスはデフォルトでそのオブジェクトを共有します。

source: If a third thread is started while the second is still running, both the second and first will be in a dormant state, and so on.
ja: 2番目のスレッドがまだ実行されている間に3番目のスレッドが開始されると、2番目と1番目のスレッドの両方が休止状態になり、以下同様となる。

source: If a thread started by this timer is still running, the timer is deleted after the thread finishes (unless it has been reenabled); otherwise, it is deleted immediately.
ja: このタイマーによって開始されたスレッドがまだ実行中であれば、スレッドの終了後にタイマーは削除され（再有効化されていない限り）、それ以外の場合は直ちに削除されます。

source: If a thrown value is not caught, the following occurs:
ja: スローされた値がキャッチされなかった場合、以下のことが起こる：

source: If a timer is disabled while its function is currently running, that function will continue until it completes.
ja: タイマーが機能実行中に無効化された場合、その機能は完了するまで継続されます。

source: If a tooltip is being shown or updated, this function returns the tooltip window's unique ID (HWND), which can be used to move the tooltip or send Tooltip Control Messages.
ja: ツールチップが表示または更新されている場合、この関数はツールチップウィンドウの一意のID（HWND）を返し、ツールチップを移動したり、ツールチップコントロールメッセージを送信したりするのに使用できる。

source: If a type parameter is a variable, that variable's content is always used, never its name.
ja: 型パラメータが変数である場合、その変数の内容が常に使用され、その名前は使用されます。

source: If a variable is not visible within a given scope, the same name can refer to a different variable.
ja: ある変数が与えられたスコープ内で見えない場合、同じ名前で別の変数を参照することができます。

source: If a variable is referenced non-dynamically but only assigned dynamically, a load-time warning may be displayed.
ja: 変数が非動的に参照され、動的にのみ割り当てられる場合、ロードタイム警告が表示される場合があります。

source: If a width (W) is specified in Options but no rows (R) or height (H), the text will be word-wrapped as needed, and the control's height will be set automatically.
ja: オプションで幅（W）を指定し、行（R）または高さ（H）を指定しない場合、テキストは必要に応じてワードラップされ、コントロールの高さが自動的に設定されます。

source: If a window does not close via WinClose, you can force it to close with WinKill.
ja: WinCloseで閉じないウィンドウは、WinKillで強制的に閉じることができます。

source: If a window matches one of the criteria in the group, it is considered a match.
ja: ウィンドウがグループ内の条件のいずれかに一致する場合、一致とみなされます。
